Tekla.Structures.Analysis.Remoting.ICDelegate
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportGetDotType(Tekla.Structures.AnalysisInternal.DotAnalysisObject@)
DO NOT USE! For internal usage only!
AnalysisObject: The analysis object.
Returns: Returns the dot type of an analysis object.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportEnumerateAnalysisObjects(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
DO NOT USE! For internal usage only!
Enumerator: Enumerator.
Returns: Returns TRUE if successfully created an enumerator.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully inserted an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully selected an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully modified an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if successfully deleted an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisModelObjectOperation(Tekla.Structures.Analysis.DotAnalysisModelObjectOperation@)
DO NOT USE! For internal usage only!
AnalysisModelObjectOperation: Analysis model object operation.
Returns: Returns TRUE if successfully deleted an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if setting active analysis model is succesful.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportGetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!
AnalysisModel: The analysis model.
Returns: Returns TRUE if getting active analysis model is succesful.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully inserted an analysis part.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully selected an analysis part.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully modified an analysis part.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!
AnalysisPart: The analysis part.
Returns: Returns TRUE if successfully deleted an analysis part.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis node.
Returns: Returns TRUE if successfully inserted an analysis node.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis node.
Returns: Returns TRUE if successfully selected an analysis node.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis node.
Returns: Returns TRUE if successfully modified an analysis node.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!
AnalysisNode: The analysis node.
Returns: Returns TRUE if successfully selected an analysis node.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis ndoe link.
Returns: Returns TRUE if successfully inserted an analysis node link.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis node link.
Returns: Returns TRUE if successfully selected an analysis node link.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis node link.
Returns: Returns TRUE if successfully modified an analysis node link.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!
AnalysisNodeLink: The analysis node link.
Returns: Returns TRUE if successfully deleted an analysis node link.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully inserted an analysis bar.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully selected an analysis bar.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully modifyed an analysis bar.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!
AnalysisBar: The analysis bar.
Returns: Returns TRUE if successfully deleted an analysis bar.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully inserted an analysis area.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully selected an analysis area.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully modifyed an analysis area.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!
AnalysisArea: The analysis area.
Returns: Returns TRUE if successfully Ddleteed an analysis area.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisVolume(Tekla.Structures.AnalysisInternal.DotAnalysisVolume@)
DO NOT USE! For internal usage only!
AnalysisVolume: The analysis volume.
Returns: Returns TRUE if successfully selected an analysis volume.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE if successfully modified an analysis member.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!
AnalysisMember: The analysis member.
Returns: Returns TRUE if successfully selected an analysis member.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedNodeLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedNodeLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedNodeLoad: The analysis decomposed node load.
Returns: Returns TRUE if successfully selected an analysis decomposed node load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedBarLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedBarLoad: The analysis decomposed bar load.
Returns: Returns TRUE if successfully selected an analysis decomposed bar load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedAreaLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedAreaLoad: The analysis decomposed area load.
Returns: Returns TRUE if successfully selected an analysis decomposed area load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedMemberLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedMemberLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedMemberLoad: The analysis decomposed member load.
Returns: Returns TRUE if successfully selected an analysis decomposed member load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedSelfweightLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedSelfweightLoad: The analysis decomposed selfweight load.
Returns: Returns TRUE if successfully selected an analysis decomposed selfweight load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDecomposedTemperatureLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad@)
DO NOT USE! For internal usage only!
AnalysisDecomposedTemperatureLoad: The analysis decomposed temperature load.
Returns: Returns TRUE if successfully selected an analysis decomposed temperature load.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE if successfully modified an analysis edge.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!
AnalysisEdge: The analysis edge.
Returns: Returns TRUE if successfully selected an analysis edge.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE if successfully inserted an analysis position.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!
AnalysisPosition: The analysis position.
Returns: Returns TRUE if successfully selected an analysis position.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportMoveAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove@)
DO NOT USE! For internal usage only!
AnalysisPositionMove: The analysis position move.
Returns: Returns TRUE if successfully moved an analysis position.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE if successfully selected an analysis model design properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!
AnalysisModelDesignProperties: The analysis model design properties.
Returns: Returns TRUE if successfully modified an analysis model design properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE if successfully selected an analysis model Job properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!
AnalysisModelJobProperties: The analysis model job properties.
Returns: Returns TRUE if successfully modified an analysis model Job properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE if successfully selected an analysis model modal analysis properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!
AnalysisModelModalAnalysisProperties: The analysis model modal analysis properties.
Returns: Returns TRUE if successfully modified an analysis model modal analysis properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE if successfully selected an analysis model output properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!
AnalysisModelOutputProperties: The analysis model output properties.
Returns: Returns TRUE if successfully modified an analysis model output properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE if successfully selected an analysis model seismic properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSeismicProperties: The analysis model seismic properties.
Returns: Returns TRUE if successfully modified an analysis model seismic properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model spectrum properties.
Returns: Returns TRUE if successfully selected an analysis model spectrum properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!
AnalysisModelSpectrumProperties: The analysis model spectrum properties.
Returns: Returns TRUE if successfully modified an analysis model spectrum properties.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully selected an analysis design parameter.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully modified an analysis design parameter.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully selected an analysis design parameter.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!
analysisDesignParameter: The analysis design parameter.
Returns: Returns TRUE if successfully modified an analysis design parameter.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisModelConnectivityRule(Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule@)
DO NOT USE! For internal usage only!
AnalysisModelConnectivityRule: The analysis model connectivity rule.
Returns: Returns TRUE if successfully selected an analysis model connectivity rule.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisFace(Tekla.Structures.AnalysisInternal.DotAnalysisFace@)
DO NOT USE! For internal usage only!
AnalysisFace: The analysis model connectivity rule.
Returns: Returns TRUE if successfully selected an analysis model connectivity rule.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisVolumeItem(Tekla.Structures.AnalysisInternal.DotAnalysisVolumeItem@)
DO NOT USE! For internal usage only!
AnalysisVolumeItem: The analysis model connectivity rule.
Returns: Returns TRUE if successfully selected an analysis model connectivity rule.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE if successfully inserted an analysis cross section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE if successfully deleted an analysis cross section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!
AnalysisCrossSection: The analysis cross section.
Returns: Returns TRUE if successfully selected an analysis cross section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis sub section.
points: The points.
Returns: Returns TRUE if successfully inserted an analysis sub section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only!
AnalysisSubSection: The analysis sub section.
points: The points.
Returns: Returns TRUE if successfully selected an analysis sub section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisMaterial(Tekla.Structures.AnalysisInternal.DotAnalysisMaterial@)
DO NOT USE! For internal usage only!
AnalysisMaterial: The analysis material.
Returns: Returns TRUE if successfully selected an analysis material.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisRigidDiaphragm(Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm@)
DO NOT USE! For internal usage only!
AnalysisRigidDiaphragm: Analysis rigid diaphragm.
Returns: Returns TRUE if successfully selected an analysis rigid diaphragm.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup@)
DO NOT USE! For internal usage only!
AnalysisLoadGroup: Analysis load group.
Returns: Returns TRUE if successfully selected an analysis load group.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
AnalysisLoadCombination: Analysis load combination.
Returns: Returns TRUE if successfully inserted an analysis load combination.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportSelectAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
AnalysisLoadCombination: Analysis load combination.
Returns: Returns TRUE if successfully selected an analysis load combination.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportModifyAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
AnalysisLoadCombination: Analysis load combination.
Returns: Returns TRUE if successfully modified an analysis load combination.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!
AnalysisLoadCombination: Analysis load combination.
Returns: Returns TRUE if successfully delete an analysis load combination.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportInsertAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
pResultCase:
pResultValue:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportDeleteAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
pResultCase:
pResultValue:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportGetAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultValue_t,System.Int32,System.Collections.Generic.List{Tekla.Structures.AnalysisInternal.dotADResultValue_t}@)
DO NOT USE! For internal usage only!
resultValue: The key.
sort: Sort true/false.
pResultValues: The results.
Returns: Returns TRUE if successfully selected an analysis sub section.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportGetAnalysisResultCase(Tekla.Structures.AnalysisInternal.dotADResultCase_t@)
DO NOT USE! For internal usage only!
pResultCase:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportQueryAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
pResultCase:
pResultValue:
Returns: